app/controllers/days_controller.rb

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "days".* FROM "days" WHERE "days"."employee_id" = ? AND "days"."id" = ? LIMIT ?  [["employee_id", 2], ["id", 1], ["LIMIT", 1]]
---
  def edit
    @employee = Employee.find(params[:employee_id])
    @day = @employee.days.find(params[:id])

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "days".* FROM "days" WHERE "days"."employee_id" = ? AND "days"."id" = ? LIMIT ?  [["employee_id", 2], ["id", 1], ["LIMIT", 1]]
UPDATE "days" SET "in_time" = ?, "out_time" = ?, "day_type" = ?, "updated_at" = ? WHERE "days"."id" = ?  [["in_time", "1800"], ["out_time", "0300"], ["day_type", "Normal Day"], ["updated_at", "2023-11-25 05:15:28.150862"], ["id", 50]]
---
  def update
    @employee = Employee.find(params[:employee_id])
    @day = @employee.days.find(params[:id])

    converted_params = day_params
    converted_params[:in_time] = convert_to_string(converted_params[:in_time])
    converted_params[:out_time] = convert_to_string(converted_params[:out_time])

    if @day.update(converted_params)