app/controllers/employees_controller.rb

  def create
    @employee = Employee.new(employee_params)
    if @employee.save
---
INSERT INTO "employees" ("name", "created_at", "updated_at", "daily_salary") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "John Doe"], ["created_at", "2023-11-24 18:55:53.824484"], ["updated_at", "2023-11-24 18:55:53.824484"], ["daily_salary", 500.0]]

  def update
    @employee = Employee.find(params[:id])
    if @employee.update(employee_params)
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "employees" SET "updated_at" = ?, "daily_salary" = ? WHERE "employees"."id" = ?  [["updated_at", "2023-11-25 00:31:25.748996"], ["daily_salary", 500.0], ["id", 6]]

  def generate_payroll
    @employee = Employee.find(params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]