app/models/employee.rb

SELECT "days".* FROM "days" WHERE "days"."employee_id" = ?  [["employee_id", 6]]
---
  def detailed_payroll_report
    self.days.each_with_index.map do |day, index|

SELECT COUNT(*) FROM "days" WHERE "days"."employee_id" = ? AND (in_time = out_time)  [["employee_id", 5]]
---
  def compute_weekly_absences
    self.days.where("in_time = out_time").count

INSERT INTO "days" ("in_time", "out_time", "is_rest", "day_type", "employee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create_default_days
    7.times { |i| self.days.create(default_day_attributes(i)) }